#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Nameplate

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WBP_Nameplate.WBP_Nameplate_C.ExecuteUbergraph_WBP_Nameplate
// 0x0038 (0x0038 - 0x0000)
struct WBP_Nameplate_C_ExecuteUbergraph_WBP_Nameplate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_CustomEvent_Color_and_Opacity;              // 0x0004(0x0014)(ConstParm)
	class FString                                 K2Node_CustomEvent_PlayerName;                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
};
DUMPER7_ASSERTS_WBP_Nameplate_C_ExecuteUbergraph_WBP_Nameplate;

// Function WBP_Nameplate.WBP_Nameplate_C.SetColor
// 0x0014 (0x0014 - 0x0000)
struct WBP_Nameplate_C_SetColor final
{
public:
	struct FSlateColor                            Color_and_Opacity;                                 // 0x0000(0x0014)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_Nameplate_C_SetColor;

// Function WBP_Nameplate.WBP_Nameplate_C.SetPlayerName
// 0x0010 (0x0010 - 0x0000)
struct WBP_Nameplate_C_SetPlayerName final
{
public:
	class FString                                 playerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Nameplate_C_SetPlayerName;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
